# Задача 32: Определить индексы элементов списка, значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума).
#
# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]
# ------------------------------------------------------

lst = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
low = 5
high = 15
print(f"{lst}\n{low}\n{high}")

# result = [i for i in range(len(lst)) if low <= lst[i] <= high]  # Также можно добавлять условие в начале.
# print(result)

print([index for index, value in enumerate(lst) if low <= value <= high])
