# 1. Задайте список из нескольких чисел.
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
#
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# ------------------------------------------------------

list = [2, 3, 5, 9, 3]
sum = 0

if i%2 in

    # list = [2, 3, 5, 9, 3]
    #
    # sum = 0
    #
    # for i in range(len(list)):
    #     if i % 2 == 1:
    #         sum += list[i]
    #
    # print(sum)

# elements = str.split(input("Введите список элементов:"))
# elements = [int(i) for i in elements]
# i = 0
# sum = 0
# sp = []
# while i < len(elements):
#     sum = sum + elements[i]
#     sp.append(elements[i])
#     i = i + 2
# print(f"На нечетных позициях стоят элементы {sp} их сумма равна {sum}")

# from random import randint as RDn = int(input("Введите количество элементов массива : "))a = [RD(0,10) for _ in range(n)]print("Массив состоит из: ", *a)print(sum([a[i] for i in range(0, len(a), 2)]))

# my_list = [8, 5, 7, 3, 6]
# print(sum(my_list[1::2]))
