# Напишите программу, которая принимает на
# вход вещественное число и показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0, 56 -> 11
# ------------------------------------------------------

# import re
#
# n = input("Введите число: ")
# print(n)
# m = re.sub("[-,]","",n)
# print(m)
# # m = int(m)
#
# result = lambda m: int(m)
# # for i in range(len(m)):
# #     result += int(m[i])
#
# print(result)



# import re
#
# n = input("Введите число: ")
# print(n)
# m = re.sub("[-,]","",n)
# print(m)
#
# result = sum(map(lambda x: int(x), m))
# # for i in range(len(m)):
# #     result += int(m[i])
#
# print(result)