# Задача №21. Решение в группах.
# Напишите программу для печати всех уникальных значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
#         {"VII": " S005 "}, {" V ":" S009 "}, {" VIII":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально, пользователь его не вводит.
# ------------------------------------------------------

dictionary = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
              {"VII": " S005 "}, {" V ": " S009 "}, {" VIII": " S007 "}]
s = set()

for item in dictionary:
    for value in item.values():
        s.add(value.strip())  # Выводит неповторяющиеся значения словаря (С УДАЛЕНИЕМ пробелов).

print(*s)
